Revit 2027 API
IFCProjectLevelGUIDType Enumeration
 The type of the GUID to be retrieved from Revit.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCProjectLevelGUIDType
Public Enumeration IFCProjectLevelGUIDType
public enum class IFCProjectLevelGUIDType
type IFCProjectLevelGUIDType
Members
Member name | Value | Description
Building | 1 |  The building GUID.
Project | 0 |  The project GUID.
Site | 2 |  The site GUID.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace